#+BEGIN_COMMENT
.. title: Edabit: Convert a Number to Base-2
.. slug: edabit-convert-a-number-to-base-2
.. date: 2023-11-13 21:13:10 UTC-05:00
.. tags: edabit,puzzle,algorithm
.. category: Puzzle
.. link: 
.. description: Converting a number from decimal to base-2.
.. type: text
.. status: 
.. updated: 
.. has_math: True
#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 2
#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-2816b8b2-3d9d-46bb-9207-2ecacb4bcc7e-ssh.json
#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC
** The Built-In Solution

It turns out that python has a built-in function (~bin~) that solves the problem. They don't explicitly say not to use it, but I'll assume that it isn't what's intended to be used as a solution and use it instead to test any solution I create.

#+begin_src python :results output :exports both
def built_in(integer: int) -> str:
    """Convert an integer to a string of bits

    Args:

     - `integer`: the base-10 number to convert

    Returns:

     bit-string equivalent of the input
    """
    return bin(integer).lstrip("-0b")

print(built_in(5))
#+end_src

#+RESULTS:
: 101

* The First Python Solution

There's probably an even more brute-force way to do this, but the first thing that came into my mind was to use the $\log_2$ function to find out what exponent of 2 is needed to create the input (without going over) so I'd know how many bits I'd need (this actually gives one less than what you need, since we need an extra bit for the $2^0$ digit). After finding the exponent the function will then traverses a range in backwards order $\{n, n-1, \ldots, 1, 0\}$, using the values as the exponent for the next power of 2 to test. If the power is less than the amount remaining to convert I add a ~1~ to the bit-list and subtract the power from the remainder and if not I add a ~0~ to the list and move to the next exponent to check.

#+begin_src python :results output :exports both
def solution_one(value: int) -> str:
    """Convert the integer to a binary string

    Args:
     - value: base-10 integer to convert

    Returns:
     - binary string version of the input
    """
    ZERO, ONE = "0", "1"
    if value == 0:
        return ZERO
    
    digits = math.floor(math.log2(value)) + 1
    remainder = value
    bits = []
    
    for exponent in reversed(range(digits)):
        if 2**exponent <= remainder:
            bits.append(ONE)
            remainder -= 2**exponent
        else:
            bits.append(ZERO)
    return "".join(bits)

tester_tester(solution_one, verbose=True)
#+end_src

#+RESULTS:
: decimal: 0 binary: 0
: decimal: 1 binary: 1
: decimal: 5 binary: 101
: decimal: 10 binary: 1010
: decimal: 242 binary: 11110010

* A Python 3 Solution

While I was checking out python's [[https://docs.python.org/3/library/math.html#power-and-logarithmic-functions][Power and Logarithmic functions]] I noticed that there was a helpful box noting that python's integers have a built in method called ~bit_length~ that will tell you how many bits you need to represent the integer. This should give the the same result as what I did with ~floor~ and ~log2~ but since they went to all the trouble of adding it as a method it seemed like it'd be a shame not to use it.

#+begin_src python :results output :exports both
def solution_three(value: int) -> str:
    """Convert the integer to a binary string

    Args:
     - value: base-10 integer to convert

    Returns:
     - binary string version of the input
    """
    ZERO, ONE = "0", "1"
    digits = value.bit_length()
    bits = []
    remainder = value

    for exponent in reversed(range(digits)):
        if 2**exponent <= remainder:
            bits.append(ONE)
            remainder -= 2**exponent
        else:
            bits.append(ZERO)
    return "".join(bits) if bits else ZERO

tester_tester(solution_three, verbose=True)
#+end_src

#+RESULTS:
: decimal: 0 binary: 0
: decimal: 1 binary: 1
: decimal: 5 binary: 101
: decimal: 10 binary: 1010
: decimal: 926 binary: 1110011110

